[
    {
        "role":"Sr. Development Manager",
        "company":"Jane App",
        "summary":"Jane offers online booking, charting, scheduling, secure video and invoicing on one secure, beautifully designed system.\n- Lead the Payments Team and Payroll Team\n\nRuby on Rails, React, AWS",
        "range":"April 2025 - Current"
    },
    {
        "role":"CTO / COO",
        "company":"Tribe Property Technology / Tribe Property Management",
        "summary":"At Tribe, offers tech-elevated solutions for Building, Managing and Living in multi-family residential communities.\n Our solutions combine human interaction, access and data to support a sustainable future for our multi-family living environments.\n- Kickstarted product development roadmaps and on-time software delivery across three product families, restructuring the PDLC from Discovery to Delivery, and introducing data-driven decisioning and tooling to product feature prioritization.\n- Rebuilt a demoralized product engineering team fostering a culture of process excellence, enthusiasm, and collaboration, reorganizing and expanding to two stream-aligned teams (25 members) and doubling product development throughput over the first 1.5 years.\n- Directed all facets of service management teams encompassing Client Accounting, Strata/Condo Management, Rental Management, and Administration, leading a senior leadership team of 9 with management oversight of a 200-member workforce.\n- Provided technology due diligence on multiple property management company acquisitions, facilitating geographic expansion into new markets in the BC Interior and Greater Toronto Area.\n- Project leadership on a transformational consolidation of multiple accounting and database platforms onto Yardi, a best of breed property management platform, reducing $100K in software licensing costs and unlocking future important operational efficiencies (e.g. paperless Accounts Payable).\n- Revitalized our self-serve rental management platform bottom line, eliminating a $250K annual loss through pricing changes and streamlined operations, positioning it for future profitability and sale.\n\nC# .NET, Angular, React, SQL Server, MS Azure, , Node.js, React, MongoDB, AWS",
        "range":"August 2021 - April 2024"
    },
    {
        "role":"VP Engineering",
        "company":"Lendesk",
        "summary":"Lendesk enables mortgage professionals with a complete end to end digital mortgage solution, the best of its kind in the Canadian Mortgage industry.\n- Leadership of Engineering members for all product development teams, inter-team and intra-team development processes, and product roadmap execution across 4 products (Lendesk Enterprise, Finmo, Spotlight, and Gateway).\n- Led the rapid expansion of Engineering from 4 Functional teams (25 staff) to a peak of 5 Stream-Aligned teams, an Enabling team, and supporting leadership roles (2 Directors and 70 staff).\n- Successfully stewarded the Product and Engineering departments through a year-long, enterprise workflow solution for RBC's Alternative Lending division. Resulting in a significant increase in monetized traffic, this was also Lendesk's first project for a major Canadian financial institution leading to projects with 4 of the 5 big banks.\n- Integrated the software, people, and processes of two acquired companies, restructuring the department to foster stronger relationships with acquired members while mobilizing on a major company pivot and product refocus.\n\nRuby on Rails, PHP/Laravel, Node.js, React, AWS Lambda, AWS",
        "range":"September 2018 - August 2021"
    },
    {
        "role":"VP Engineering",
        "company":"Paywith Worldwide",
        "summary":"Paywith Worldwide enables banks, brands, enterprises and aspiring fintechs to create highly differentiated card programs designed to become the default card in a consumers mobile wallet.\n- Leadership of all Engineering staff including 11 Developers, 1 QA Manager, and 4 QA maintaining 2 geographical instances of a SaaS solution, 10+ mobile apps across 4 verticals.\n- Responsible for relationship management, career development, hiring/firing, and performance monitoring of all Engineering staff.\n- Improved alignment of Engineering resources with the CEO’s strategic vision by working with Product Management to create and deploy a new company priorities review process within the senior management team.\n- Successfully delivered a mall rewards project within a tight 3-month deadline ensuring PayWith was granted the next 10 mall properties for the satisfied customer.\n- Led the Engineering team for their first time through a large project breakdown, estimation, and negotiation process to ensure project scope matched the fixed time project schedule for our next card control product and customer.\n\nRuby on Rails, AWS, Javascript, React, Android, iOS",
        "range":"October 2017 - September 2018"
    },
    {
        "role":"Owner",
        "company":"Feeny Technology Solutions",
        "summary":"Feeny Technology Solutoins was a boutique technology coaching and IT company I started as a teenager specializing in one-on-one technology consulting, guidance and support for individuals and small businesses.  In 2018, FTS shut down so that I could focus my off-time on my role at the Pacific Post Partum Support Society.",
        "range":"September 1994 - 2018"
    },
    {
        "role":"VP Research & Development",
        "company":"INETCO Systems",
        "summary":"Harness omni-channel payment data across the entire transaction journey in a single monitoring platform. Optimize operations, reduce payment transaction failures, speed up reporting cycles and forecasting by >75% with INETCO Insight.\n- Ownership and leadership of all Engineering and IT operations including 3 Leads, 13 Software Developers, and 3 QA personnel maintaining 3 products targeting large and medium financial institutions.\n- Led the R&D team through the implementation and first successful delivery of INETCO Analytics – a cluster technologies-based product allowing Business Managers unprecedented visibility into the performance of their ATM networks.\n- Responsible for training and mentorship of Leads to formalize and improve their iterative implementation cycles, working directly in the teams to sell and foster a lean paradigm for software engineering, which included purchase and deployment of the Atlassian Jira software suite. This increased accountability and transparency of R&D deliverables to downstream teams like Product Support and Sales.\n- Addressed deficiencies in inputs to the R&D team by working with PSIS, Product Management, Architecture, and the Senior Management team to create a set of processes and meetings streamlining Company Priorities and customer escalations while balancing new product and feature development.\n- Worked with the IT team to transition corporate services from legacy servers to virtualized environments, including moving QA, R&D, and PS integration testbeds.\n- Helmed the initiation and oversight of $400K project and 3rd party development team in India contracted to replace an aging UI with a web-based experience.  Responsibilities included marshaling local resources for code reviews, architectural guidance, project management, and payment milestone sign-offs.\n- Revised the hours tracking process, wrote projects and justifications, and received a record SRED tax credit.\n\nC/C++, Java, REST web services, Flex, Cloudera Hadoop (Impala, Spark, Apache Drill), Tableau",
        "range":"April 2014 - September 2017"
    },
    {
        "role":"Director of Engineering",
        "company":"Vivonet",
         "range":"October 2012 - April 2014",
         "summary":"- Took responsibility of all Engineering teams, adding the Enterprise Management team, Delphi-based Point-Of-Sale team, DevOps, and BI teams.\n- Inherited and led our Business Intelligence team through the technical challenges of balancing near real-time reporting with increasing stores of data.  Immediately hired and worked with a BI specialist increasing the efficiency of the system and reducing report lag times from 45 to 20 minutes.  Overnight load times decreased from 4 hours to 2 and team maintenance effort decreased enough to begin researching and strategizing new technologies for our replacement technology stack."
    },
    {
        "role":"Software Development Manager - Nextgen products",
        "company":"Vivonet",
        "summary":"Real-time, cloud-based point-of-sale systems for restaurants across the world.\n- Led the development team responsible for all products built on the company’s next generation of technology.  These servers handled all mobile, kiosk, enterprise business process, and stadium suite management products.\n- Instrumental in rolling out an Agile process across 4 teams, adopting a story points-based estimation system and velocity tracking, time-based burndowns for progress tracking, sprint planning, retrospectives, and reporting using Atlassian's Agile and Jira suite.\n- Inherited a mismanaged and stalled project outsourced to external contractors for the next major version of our mobile products.  Holding contractors to account in parallel with transitioning the project in-house, was able to complete and release the project within two months of the original date – considered a major success.\n- Inherited management of and successfully completed two 3rd party integration projects and relationships expanding the product set to include an inventory and labour management solution and a self-order kiosk solution\n- Creatively leveraging existing infrastructure, designed, implemented, and deployed a food ordering kiosk to a major international airport within 2.5 months from start to finish.\n\nPHP, Groovy, Spring Integration, Spring Technologies, Java, Solr, REST web services, Objective-C, Android, MySQL, Oracle, MS SSRS"
    },
    {
        "role":"Manager - Software Configuration Management & Product Owner - Test Automation",
        "company":"Rocket Gaming Systems",
        "summary":"Indigenous owned company that built casino games and systems sold and installed to casino operators throughout the U.S.\n\nIn addition to the Manager - Software Configuration Manager responsibilities mentioned below, I took on a secondary role with these additional responsibilities:\n- Assigned to Test Automation to lead the recovery of a struggling initiative and to introduce a culture of Test Automation to the R&D department.\nWithin 2 months, introduced an agile development process, TFS-based task tracking, roles and responsibilities, and broke down discipline and distributed location barriers within the team.\n- Led the extension of the automated build system to add automated smoke test marshaling, automated deployment, test framework initiation, reporting systems, and add the concept of automated testing to the existing bug lifecycle process.\n\nAnt, Nant, C#, ASP.net, Perl, Lua, C++, MS Windows XP/2000",
        "range":"March 2003 - October 2012"
    },
    {
        "role":"Manager - Software Configuration Management",
        "company":"Rocket Gaming Systems",
        "summary":"Indigenous owned company that built casino games and systems sold and installed to casino operators throughout the U.S.\n- Created Rocket’s brand new Software Configuration Management department hiring and managing 3 SCM Developers/Release Engineers responsible for all merging, builds, and installer development tasks.\n- Led the execution of Product Strategy plans through branch and merge planning with Product Management and Development Leads over 4-5 active development projects and 4 R&D offices.\n- Designed, implemented, and deployed a daily/continuous build system for 60+ products through two product lines multiplied over 4-5 active development projects at one time.\n- Liaised between Rocket R&D and various Gaming Certification Labs or State regulatory boards including Eclipse Testing (Cincinnati, OH) and Washington State Gambling Commission to achieve per-release certification of all gaming products.  Achieved a 100% success rate in a tightly regulated market.\n\nAnt, Nant, C#, ASP.net, Perl, Visual SVN, SharpSVN, QuickBuild, postgresSQL, MS Windows XP/2000/2008R2/7"
    },
    {
        "role":"Software Development Manager",
        "company":"Rocket Gaming Systems",
        "summary":"Indigenous owned company that built casino games and systems sold and installed to casino operators throughout the U.S.\n- Managed up to 4 teams of engineers (3 leads, 24 developers) with focuses ranging from Game Design mathematics to hardware-related special projects with up to 6 projects being maintained simultaneously.\n- Restructured the Rocket development department to provide a core set of engineers to address stability and maintenance projects while ensuring that currently scheduled projects remained staffed and driven to conclusion.\n- Participated in the planning and restructuring of the development department as the company shifted from component based development teams to project based development teams, increasing the efficiency of projects by reducing competition for resources and increasing cohesion within teams.\n- Created and deployed the company branching and merging strategy required for moving to a project based development department, ensuring that development continued unhindered for individual projects yet work was unified to ensure a consistent feature set for all releases thereafter."
    },
    {
        "role":"Team Lead - Client Systems",
        "company":"Red Hawk Gaming  (soon purchased by Rocket Gaming Systems)",
        "summary":"Casino Systems\n- Led a team of up to 13 developers through multiple successful releases of the Game Client, ranging from maintenance releases through to new feature package releases.\n- Effectively collaborated with server-based development teams to achieve functionality allowing Rocket Gaming’s product to seamlessly interface with other 3rd party gaming companies’ servers, expanding the sales opportunities available.\n- Led a team of 4 developers in integration of Rocket products with custom built I/O boards, laying the groundwork for future revisions that will allow Rocket to expand into US jurisdictions that require specialized solutions for state-regulated configuration and auditing.\n- Hired multiple high performing employees, some of which continued to become team leads and star performers for their departments.  Performed regular interviews for candidates outside of my teams based on strong interviewing skills.\n\nDelphi, C++, MS Windows XP"
    },
    {
        "role":"Software Developer",
        "company":"Red Hawk Gaming",
        "summary":"Company contracted by Rocket Gaming Systems, an Indigenous owned company, to build their casino games and systems sold and installed to casino operators throughout the U.S.\n- Designed, implemented and certified the first iteration of the company Game Server, still in use to this day\n- Worked directly with off-site gaming certification laboratory to secure the company’s first Class II certification opening up new markets for Sales to continue selling Rocket product.\n- Successfully negotiated critical decisions on behalf of the company that corrected certification inconsistencies during testing of our random number generator based on interpretation of US federal statistical gaming regulations.\n\nC++, mySQL, Delphi, MS Windows XP"
    },
    {
        "role":"Software Engineer",
        "company":"Infowave Software",
        "summary":"Mobile Enterprise Connectors giving mobile devices access to companies' resources in the pre- mobile VPN era\n- Member of numerous development teams working on a variety of Enterprise-level, wirelessly-enabling software solutions.\n- Served as the technical liaison for a special project with Intel, including traveling for meetings, working alongside Intel developers, and providing customized in-depth training for integration work.\n- Participated in interviewing and hiring development and quality assurance co-ops, including establishing a relationship with SFU’s Object Technology Program to increase student interest in the company.\n- Designed and developed an effective and flexible daily build process that was used extensively throughout Infowave in almost all development teams.\n- Independently researched new technologies to serve as new products as part of a Special Projects Team including a solution to view email attachments as html sent from a mobile device to a secure web server.\n\nC++, Visual Basic, Windows Scripting, Linux (Gentoo), Windows XP, InstallShield, Wise Installer",
        "range":"May 2000 - June 2002"
    },
    {
        "role":"Software Engineer - Space Robotics",
        "company":"MacDonald Dettwiler and Associates (MDA)",
        "summary":"Command and Control Software for the Canadarm 2 on the International Space Station.\n- Member of Space Station Project responsible for development of  Operation and Control Software for new Mobile Servicing System robotic arm currently being used on the International Space Station.\n- Successfully worked as a member of various groups including testing, integration, and development teams.\n- Comfortably interacted with Canadian Space Agency on numerous occasions which included reviews and acceptance tests.\n- Supervised a team of up to 3 engineers responsible for merging and integrating software changes into a final software release and created the process followed by that team.\n- Distributed work  to integration and merge members and reviewed progress, ensuring that tasks were done correctly and according to schedule.\n- Reviewed and rewrote documents pertaining to the validation and verification testing of product.\n\nAda83, Ada95, 6086 assembly, custom test script language, Unix, VAX",
        "range":"September 1998 - May 2000"
    }
]
