[
    {
        "role":"CTO / COO",
        "company":"Tribe Property Technology / Tribe Property Management",
        "summary":"At Tribe, offers tech-elevated solutions for Building, Managing and Living in multi-family residential communities.\n Our solutions combine human interaction, access and data to support a sustainable future for our multi-family living environments.",
        "range":"August 2021 - April 2024"
    },
    {
        "role":"VP Engineering",
        "company":"Lendesk",
        "summary":"Lendesk enables mortgage professionals with a complete end to end digital mortgage solution, the best of its kind in the Canadian Mortgage industry.",
        "range":"September 2018 - August 2021"
    },
    {
        "role":"VP Engineering",
        "company":"Paywith Worldwide",
        "summary":"Paywith Worldwide enables banks, brands, enterprises and aspiring fintechs to create highly differentiated card programs designed to become the default card in a consumers mobile wallet.",
        "range":"October 2017 - September 2018"
    },
    {
        "role":"Owner",
        "company":"Feeny Technology Solutions",
        "summary":"Feeny Technology Solutoins was a boutique technology coaching and IT company I started as a teenager specializing in one-on-one technology consulting, guidance and support for individuals and small businesses.  In 2018, FTS shut down so that I could focus my off-time on my role at the Pacific Post Partum Support Society.",
        "range":"September 1994 - 2018"
    },
    {
        "role":"VP Research & Development",
        "company":"INETCO Systems",
        "summary":"Harness omni-channel payment data across the entire transaction journey in a single monitoring platform. Optimize operations, reduce payment transaction failures, speed up reporting cycles and forecasting by >75% with INETCO Insight.",
        "range":"April 2014 - September 2017"
    },
    {
        "role":"Director of Engineering",
        "company":"Vivonet",
        "summary":"Real-time, cloud-based point-of-sale systems for restaurants across the world.",
        "range":"October 2012 - April 2014"
    },
    {
        "role":"Manager - Software Configuration Management & Product Owner - Test Automation",
        "company":"Rocket Gaming Systems",
        "summary":"Casino Systems",
        "range":"March 2003 - April 2014"
    },
    {
        "role":"Software Development Manager",
        "company":"Rocket Gaming Systems",
        "summary":"Casino Systems",
        "range":"March 2003 - April 2014"
    },
    {
        "role":"Team Lead - Client Systems",
        "company":"Rocket Gaming Systems",
        "summary":"Casino Systems",
        "range":"March 2003 - April 2014"
    },
    {
        "role":"Software Developer",
        "company":"Rocket Gaming Systems",
        "summary":"Casino Systems",
        "range":"March 2003 - April 2014"
    },
    {
        "role":"Software Engineer",
        "company":"Infowave Software",
        "summary":"Mobile Enterprise Connectors",
        "range":"May 2000 - June 2002"
    },
    {
        "role":"Software Engineer - Space Robotics",
        "company":"MacDonald Dettwiler and Associates (MDA)",
        "summary":"Command and Control Software for the Canadarm 2 on the International Space Station.\n- Member of Space Station Project responsible for development of  Operation and Control Software for new Mobile Servicing System robotic arm currently being used on the International Space Station.\n- Successfully worked as a member of various groups including testing, integration, and development teams.\n- Comfortably interacted with Canadian Space Agency on numerous occasions which included reviews and acceptance tests.\n- Supervised a team of up to 3 engineers responsible for merging and integrating software changes into a final software release and created the process followed by that team.\n- Distributed work  to integration and merge members and reviewed progress, ensuring that tasks were done correctly and according to schedule.\n- Reviewed and rewrote documents pertaining to the validation and verification testing of product.\n\n Technologies: Ada83, Ada95, 6086 assembly, custom test script language, Unix, VAX",
        "range":"September 1998 - May 2000"
    }
]